BAS BMEKZU Project/src/Enums/скEDI_События/скEDI_События.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_События</name>
  <enumValues>
    <name>ПередПодписанием</name>
  </enumValues>
  <enumValues>
    <name>ПриПодписании</name>
  </enumValues>
  <enumValues>
    <name>ПередОтправкой</name>
  </enumValues>
  <enumValues>
    <name>ПриОтправке</name>
  </enumValues>
  <enumValues>
    <name>ПередПодтверждением</name>
  </enumValues>
  <enumValues>
    <name>ПриПодтверждении</name>
  </enumValues>
  <enumValues>
    <name>ПередОтклонением</name>
  </enumValues>
  <enumValues>
    <name>ПриОтклонении</name>
  </enumValues>
  <enumValues>
    <name>ПередОтзывом</name>
  </enumValues>
  <enumValues>
    <name>ПриОтзыве</name>
  </enumValues>
  <enumValues>
    <name>ПриПолученииЭлектронногоДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПриПолученииКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПриПроверкеНалоговогоДокумента</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/скEDI_События/ManagerModule.bsl
Функция ПолучитьТекстОписанияИспользования(Событие) Экспорт
	Если Событие = Перечисления.скEDI_События.ПередПодписанием Тогда
		Возврат НСтр("ru = 'В тексте выражения можно использовать следующие предопределенные переменные:
                      |   Отказ - Признак отказа от подписания документа
                      |   ПричинаОтказа - Причина отказа от подписания документа
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписей - Массив Структур (Подпись, ПодписаноРанее, ПодписываетсяСейчас)
                      |Встроенные функции, функции общих модулей.'; uk = 'В тексті виразу можна використовувати наступні змінні:
                      |   Отказ - Ознака відмови від підписання документу
                      |   ПричинаОтказа - Причина відмови від підписання документу
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписей - Массив Структур (Подпись, ПодписаноРанее, ПодписываетсяСейчас)
                      |Встроєні функції, функції загальних модулів.'");
	ИначеЕсли Событие = Перечисления.скEDI_События.ПриПодписании Тогда
		Возврат НСтр("ru = 'В тексте выражения можно использовать следующие предопределенные переменные:
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписей - Массив Структур (Подпись, ПодписаноРанее, ПодписываетсяСейчас)
                      |Встроенные функции, функции общих модулей.'; uk = 'В тексті виразу можна використовувати наступні змінні:
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписей - Массив Структур (Подпись, ПодписаноРанее, ПодписываетсяСейчас)
                      |Встроєні функції, функції загальних модулів.'");
	ИначеЕсли Событие = Перечисления.скEDI_События.ПередОтправкой Тогда
		Возврат НСтр("ru = 'В тексте выражения можно использовать следующие предопределенные переменные:
                      |   Отказ - Признак отказа от отправки документа
                      |   ПричинаОтказа - Причина отказа от подписания документа
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписей - Массив Структур (Подпись, ПодписаноРанее, ПодписываетсяСейчас)
                      |Встроенные функции, функции общих модулей.'; uk = 'В тексті виразу можна використовувати наступні змінні:
                      |   Отказ - Ознака відмови від відправлення документу
                      |   ПричинаОтказа - Причина відмови від підписання документу
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписей - Массив Структур (Подпись, ПодписаноРанее, ПодписываетсяСейчас)
                      |Встроєні функції, функції загальних модулів.'");
	ИначеЕсли Событие = Перечисления.скEDI_События.ПриОтправке Тогда
		Возврат НСтр("ru = 'В тексте выражения можно использовать следующие предопределенные переменные:
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписей - Массив Структур (Подпись, ПодписаноРанее, ПодписываетсяСейчас)
                      |Встроенные функции, функции общих модулей.'; uk = 'В тексті виразу можна використовувати наступні змінні:
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписей - Массив Структур (Подпись, ПодписаноРанее, ПодписываетсяСейчас)
                      |Встроєні функції, функції загальних модулів.'");
	ИначеЕсли Событие = Перечисления.скEDI_События.ПередПодтверждением
		или Событие = Перечисления.скEDI_События.ПередОтклонением
		или Событие = Перечисления.скEDI_События.ПередОтзывом
		Тогда
		
		Возврат НСтр("ru = 'В тексте выражения можно использовать следующие предопределенные переменные:
                      |   Отказ - Признак отказа от отправки документа
                      |   ПричинаОтказа - Причина отказа от подписания документа
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписей - Массив Структур (Подпись, ПодписаноРанее, ПодписываетсяСейчас)
                      |Встроенные функции, функции общих модулей.'; uk = 'В тексті виразу можна використовувати наступні змінні:
                      |   Отказ - Ознака відмови від відправлення документу
                      |   ПричинаОтказа - Причина відмови від підписання документу
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписей - Массив Структур (Подпись, ПодписаноРанее, ПодписываетсяСейчас)
                      |Встроєні функції, функції загальних модулів.'");
	ИначеЕсли Событие = Перечисления.скEDI_События.ПриПодтверждении
		или Событие = Перечисления.скEDI_События.ПриОтклонении
		или Событие = Перечисления.скEDI_События.ПриОтзыве
		Тогда
		Возврат НСтр("ru = 'В тексте выражения можно использовать следующие предопределенные переменные:
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписей - Массив Структур (Подпись, ПодписаноРанее, ПодписываетсяСейчас)
                      |Встроенные функции, функции общих модулей.'; uk = 'В тексті виразу можна використовувати наступні змінні:
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписей - Массив Структур (Подпись, ПодписаноРанее, ПодписываетсяСейчас)
                      |Встроєні функції, функції загальних модулів.'");
	ИначеЕсли Событие = Перечисления.скEDI_События.ПриПолученииЭлектронногоДокумента Тогда
		Возврат НСтр("ru = 'В тексте выражения можно использовать следующие предопределенные переменные:
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписейКонтрагента - Массив Структур (ТелоСертификата, Подписано, ДатаПодписания, TSPСтатус, OCSPСтатус, ПодписьВерна, ЕДРПОУ, СерийныйНомер, ИспользованиеКлюча, email, ДатаНачалаДействия, ДатаОкончанияДействия, ИздательСертификата, КлючНаЗащищенномНосителе, ИдентификаторСекретногоКлюча, Фамилия, Имя, ИмяПодписанта, Роль, ДРФОПодписанта)
                      |Встроенные функции, функции общих модулей.'; uk = 'В тексті виразу можна використовувати наступні змінні:
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписейКонтрагента - Массив Структур (ТелоСертификата, Подписано, ДатаПодписания, TSPСтатус, OCSPСтатус, ПодписьВерна, ЕДРПОУ, СерийныйНомер, ИспользованиеКлюча, email, ДатаНачалаДействия, ДатаОкончанияДействия, ИздательСертификата, КлючНаЗащищенномНосителе, ИдентификаторСекретногоКлюча, Фамилия, Имя, ИмяПодписанта, Роль, ДРФОПодписанта)
                      |Встроєні функції, функції загальних модулів.'");
	ИначеЕсли Событие = Перечисления.скEDI_События.ПриПолученииКвитанции Тогда
		Возврат НСтр("ru = 'В тексте выражения можно использовать следующие предопределенные переменные:
                      |   Квитанция - ДокументСсылка.скEDI_Квитанция
                      |   ТипКвитанции - Перечисления.скEDI_ТипыКвитанций
                      |   КвитанцияВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписейКонтрагента - Массив Структур (ТелоСертификата, Подписано, ДатаПодписания, TSPСтатус, OCSPСтатус, ПодписьВерна, ЕДРПОУ, СерийныйНомер, ИспользованиеКлюча, email, ДатаНачалаДействия, ДатаОкончанияДействия, ИздательСертификата, КлючНаЗащищенномНосителе, ИдентификаторСекретногоКлюча, Фамилия, Имя, ИмяПодписанта, Роль, ДРФОПодписанта)
                      |Встроенные функции, функции общих модулей.'; uk = 'В тексті виразу можна використовувати наступні змінні:
                      |   Квитанция - ДокументСсылка.скEDI_Квитанция
                      |   ТипКвитанции - Перечисления.скEDI_ТипыКвитанций
                      |   КвитанцияВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   МассивВложений - Массив Структур (ИмяФайла, СтрокаBase64, Файл)
                      |   МассивПодписейКонтрагента - Массив Структур (ТелоСертификата, Подписано, ДатаПодписания, TSPСтатус, OCSPСтатус, ПодписьВерна, ЕДРПОУ, СерийныйНомер, ИспользованиеКлюча, email, ДатаНачалаДействия, ДатаОкончанияДействия, ИздательСертификата, КлючНаЗащищенномНосителе, ИдентификаторСекретногоКлюча, Фамилия, Имя, ИмяПодписанта, Роль, ДРФОПодписанта)
                      |Встроєні функції, функції загальних модулів.'");
	ИначеЕсли Событие = Перечисления.скEDI_События.ПриПроверкеНалоговогоДокумента Тогда
		Возврат НСтр("ru = 'В тексте выражения можно использовать следующие предопределенные переменные:
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   СоответствиеЗначенийРеквизитов - СоответствиеЗначений с реквизитами электронного документа
                      |   Замечание - Текст замечаний к документу (Ошибки)
                      |   Предупреждение - Текст замечаний к документу (Предупреждения)
                      |Встроенные функции, функции общих модулей.'; uk = 'В тексті виразу можна використовувати наступні змінні:
                      |   ВхИсх - Перечисления.скEDI_ВхИсхЭлектронныйДокумент
                      |   ГдеСоздан - Перечисления.скEDI_ГдеСоздан
                      |   ЭлектронныйДокумент - ДокументСсылка.скEDI_ЭлектронныйДокумент
                      |   УчетныйДокумент - Ссылка на Учетный документ
                      |   Состояние - скEDI_СостоянияЭлектронныхДокументов
                      |   СоответствиеЗначенийРеквизитов - СоответствиеЗначений з реквізитами електронного документа
                      |   Замечание - Текст зауважень до документу (Помилки)
                      |   Предупреждение - Текст зауважень до документу (Попередження)
                      |Встроєні функції, функції загальних модулів.'");
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции
